portapack-mayhem/mayhem-firmware/firmware/chibios-portapack/os/hal/platforms/LPC43xx/lpc43xx.inc
/*
    ChibiOS/RT - Copyright (C) 2014 Jared Boone, ShareBrained Technology

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

#ifndef __LPC43XX_H__
#define __LPC43XX_H__

/** @addtogroup NXP
  * @{
  */

/** @addtogroup LPC43xx
  * @{
  */

#ifdef __cplusplus
extern "C" {
#endif

#if defined ( __CC_ARM   )
  #pragma anon_unions
#endif

// ------------------------------------------------------------------------------------------------
// -----                                         CREG                                         -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10503 Chapter title=LPC43xx Configuration Registers (CREG) Modification date=1/28/2014 Major revision=1 Minor revision=8
  */

typedef struct {
  __IO uint32_t ETHMODE            : 3;
       uint32_t RESERVED0          : 1;
  __IO uint32_t CTOUTCTRL          : 1;
       uint32_t RESERVED1          : 7;
  __IO uint32_t I2S0_TX_SCK_IN_SEL : 1;
  __IO uint32_t I2S0_RX_SCK_IN_SEL : 1;
  __IO uint32_t I2S1_TX_SCK_IN_SEL : 1;
  __IO uint32_t I2S1_RX_SCK_IN_SEL : 1;
  __IO uint32_t EMC_CLK_SEL        : 1;
       uint32_t RESERVED2          : 15;
} LPC_CREG_CREG6_Type;

typedef struct {
       uint32_t RESERVED0;
  __IO uint32_t CREG0;
       uint32_t RESERVED1[62];
  __IO uint32_t M4MEMMAP;
       uint32_t RESERVED2[5];
  __IO uint32_t CREG5;
  __IO uint32_t DMAMUX;
  __IO uint32_t FLASHCFGA;
  __IO uint32_t FLASHCFGB;
  __IO uint32_t ETBCFG;
  LPC_CREG_CREG6_Type CREG6;
  __IO uint32_t M4TXEVENT;
       uint32_t RESERVED3[51];
  __I  uint32_t CHIPID;
       uint32_t RESERVED4[65];
  __IO uint32_t M0SUBMEMMAP;
       uint32_t RESERVED5[2];
  __IO uint32_t M0SUBTXEVENT;
       uint32_t RESERVED6[58];
  __IO uint32_t M0APPTXEVENT;
  __IO uint32_t M0APPMEMMAP;
       uint32_t RESERVED7[62];
  __IO uint32_t USB0FLADJ;
       uint32_t RESERVED8[63];
  __IO uint32_t USB1FLADJ;
} LPC_CREG_Type;

// ------------------------------------------------------------------------------------------------
// -----                                          CGU                                         -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10503 Chapter title=LPC43xx Clock Generation Unit (CGU) Modification date=1/28/2014 Major revision=1 Minor revision=8
  */

typedef struct {
  __IO uint32_t RCNT        : 9;
  __I  uint32_t FCNT        : 14;
  __IO uint32_t MEAS        : 1;
  __IO uint32_t CLK_SEL     : 5;
       uint32_t RESERVED0   : 3;
} LPC_CGU_FREQ_MON_Type;

typedef union {
  struct {
    __IO uint32_t ENABLE      : 1;
    __IO uint32_t BYPASS      : 1;
    __IO uint32_t HF          : 1;
         uint32_t RESERVED0   : 29;
  };
  __IO uint32_t word;
} LPC_CGU_XTAL_OSC_CTRL_Type;

typedef struct {
  __I  uint32_t LOCK        : 1;
  __I  uint32_t FR          : 1;
       uint32_t RESERVED0   : 30;
} LPC_CGU_PLL0USB_STAT_Type;

typedef struct {
  __IO uint32_t PD          : 1;
  __IO uint32_t BYPASS      : 1;
  __IO uint32_t DIRECTI     : 1;
  __IO uint32_t DIRECTO     : 1;
  __IO uint32_t CLKEN       : 1;
       uint32_t RESERVED0   : 1;
  __IO uint32_t FRM         : 1;
       uint32_t RESERVED1   : 4;
  __IO uint32_t AUTOBLOCK   : 1;
       uint32_t RESERVED2   : 12;
  __IO uint32_t CLK_SEL     : 5;
       uint32_t RESERVED3   : 3;
} LPC_CGU_PLL0USB_CTRL_Type;

typedef struct {
  __I  uint32_t LOCK        : 1;
       uint32_t RESERVED0   : 31;
} LPC_CGU_PLL1_STAT_Type;

typedef struct {
  __IO uint32_t PD          : 1;
  __IO uint32_t BYPASS      : 1;
       uint32_t RESERVED0   : 4;
  __IO uint32_t FBSEL       : 1;
  __IO uint32_t DIRECT      : 1;
  __IO uint32_t PSEL        : 2;
       uint32_t RESERVED1   : 1;
  __IO uint32_t AUTOBLOCK   : 1;
  __IO uint32_t NSEL        : 2;
       uint32_t RESERVED2   : 2;
  __IO uint32_t MSEL        : 8;
  __IO uint32_t CLK_SEL     : 5;
       uint32_t RESERVED3   : 3;
} LPC_CGU_PLL1_CTRL_Type;

typedef union {
  struct {
    __IO uint32_t PD          : 1;
         uint32_t RESERVED0   : 1;
    __IO uint32_t IDIV        : 2;
         uint32_t RESERVED1   : 7;
    __IO uint32_t AUTOBLOCK   : 1;
         uint32_t RESERVED2   : 12;
    __IO uint32_t CLK_SEL     : 5;
         uint32_t RESERVED3   : 3;
  };
  __IO uint32_t word;  
} LPC_CGU_IDIVx_CTRL_Type;

typedef struct {
  __I  uint32_t PD          : 1;
       uint32_t RESERVED0   : 10;
  __I  uint32_t AUTOBLOCK   : 1;
       uint32_t RESERVED1   : 12;
  __I  uint32_t CLK_SEL     : 5;
       uint32_t RESERVED2   : 3;
} LPC_CGU_BASE_SAFE_CLK_Type;

typedef union {
  struct {
    __IO uint32_t PD          : 1;
         uint32_t RESERVED0   : 10;
    __IO uint32_t AUTOBLOCK   : 1;
         uint32_t RESERVED1   : 12;
    __IO uint32_t CLK_SEL     : 5;
         uint32_t RESERVED2   : 3;
  };
  __IO uint32_t word;
} LPC_CGU_BASE_CLK_Type;

typedef struct {
       uint32_t RESERVED[5];        /* +0x000 */
  LPC_CGU_FREQ_MON_Type       FREQ_MON;
  LPC_CGU_XTAL_OSC_CTRL_Type  XTAL_OSC_CTRL;
  LPC_CGU_PLL0USB_STAT_Type   PLL0USB_STAT;
  LPC_CGU_PLL0USB_CTRL_Type   PLL0USB_CTRL;       /* +0x020 */
  __IO uint32_t               PLL0USB_MDIV;
  __IO uint32_t               PLL0USB_NP_DIV;
  __I  uint32_t               PLL0AUDIO_STAT;
  __IO uint32_t               PLL0AUDIO_CTRL;     /* +0x030 */
  __IO uint32_t               PLL0AUDIO_MDIV;
  __IO uint32_t               PLL0AUDIO_NP_DIV;
  __IO uint32_t               PLL0AUDIO_FRAC;
  __I  uint32_t               PLL1_STAT;          /* +0x040 */
  __IO uint32_t               PLL1_CTRL;
  LPC_CGU_IDIVx_CTRL_Type     IDIVA_CTRL;
  LPC_CGU_IDIVx_CTRL_Type     IDIVB_CTRL;
  LPC_CGU_IDIVx_CTRL_Type     IDIVC_CTRL;         /* +0x050 */
  LPC_CGU_IDIVx_CTRL_Type     IDIVD_CTRL;
  LPC_CGU_IDIVx_CTRL_Type     IDIVE_CTRL;
  LPC_CGU_BASE_SAFE_CLK_Type  BASE_SAFE_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_USB0_CLK;      /* +0x060 */
  LPC_CGU_BASE_CLK_Type       BASE_PERIPH_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_USB1_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_M4_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_SPIFI_CLK;     /* +0x070 */
  LPC_CGU_BASE_CLK_Type       BASE_SPI_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_PHY_RX_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_PHY_TX_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_APB1_CLK;      /* +0x080 */
  LPC_CGU_BASE_CLK_Type       BASE_APB3_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_LCD_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_ADCHS_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_SDIO_CLK;      /* +0x090 */
  LPC_CGU_BASE_CLK_Type       BASE_SSP0_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_SSP1_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_UART0_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_UART1_CLK;     /* +0x0a0 */
  LPC_CGU_BASE_CLK_Type       BASE_UART2_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_UART3_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_OUT_CLK;
       uint32_t OUTCLK_21_CTRL;     /* +0x0b0 */
       uint32_t OUTCLK_22_CTRL;
       uint32_t OUTCLK_23_CTRL;
       uint32_t OUTCLK_24_CTRL;
  LPC_CGU_BASE_CLK_Type       BASE_AUDIO_CLK;     /* +0x0c0 */
  LPC_CGU_BASE_CLK_Type       BASE_CGU_OUT0_CLK;
  LPC_CGU_BASE_CLK_Type       BASE_CGU_OUT1_CLK;
} LPC_CGU_Type;

// ------------------------------------------------------------------------------------------------
// -----                                          CCU                                         -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10503 Chapter title=LPC43xx Clock Control Unit (CCU) Modification date=1/28/2014 Major revision=1 Minor revision=8
  */

