portapack-mayhem/mayhem-firmware/firmware/chibios-portapack/os/hal/platforms/LPC43xx/lpc43xx.inc
typedef struct {
  __IO uint32_t RUN       : 1;
  __IO uint32_t AUTO      : 1;
  __IO uint32_t WAKEUP    : 1;
       uint32_t RESERVED0 : 29;
} LPC_CCU1_CFG_160_Type;

typedef struct {
  __IO uint32_t RUN       : 1;
  __IO uint32_t AUTO      : 1;
  __IO uint32_t WAKEUP    : 1;
       uint32_t RESERVED0 : 2;
  __O  uint32_t DIV       : 3;
       uint32_t RESERVED1 : 19;
  __I  uint32_t DIVSTAT   : 3;
       uint32_t RESERVED2 : 2;
} LPC_CCU1_CFG_161_Type;

typedef struct {
  __I  uint32_t RUN       : 1;
  __I  uint32_t AUTO      : 1;
  __I  uint32_t WAKEUP    : 1;
       uint32_t RESERVED0 : 2;
  __I  uint32_t RUN_N     : 1;
       uint32_t RESERVED1 : 26;
} LPC_CCU_STAT_Type;

typedef struct {
  __IO uint32_t PM;                           /* +0x000 */
  __I  uint32_t BASE_STAT;                    /* +0x004 */
       uint32_t RESERVED0[62];                /* +0x008 */
  LPC_CCU1_CFG_160_Type CLK_APB3_BUS_CFG;             /* +0x100 */
  LPC_CCU_STAT_Type CLK_APB3_BUS_STAT;
  LPC_CCU1_CFG_160_Type CLK_APB3_I2C1_CFG;
  LPC_CCU_STAT_Type CLK_APB3_I2C1_STAT;
  LPC_CCU1_CFG_160_Type CLK_APB3_DAC_CFG;
  LPC_CCU_STAT_Type CLK_APB3_DAC_STAT;
  LPC_CCU1_CFG_160_Type CLK_APB3_ADC0_CFG;
  LPC_CCU_STAT_Type CLK_APB3_ADC0_STAT;
  LPC_CCU1_CFG_160_Type CLK_APB3_ADC1_CFG;
  LPC_CCU_STAT_Type CLK_APB3_ADC1_STAT;
  LPC_CCU1_CFG_160_Type CLK_APB3_CAN0_CFG;
  LPC_CCU_STAT_Type CLK_APB3_CAN0_STAT;
       uint32_t RESERVED1[52];
  LPC_CCU1_CFG_160_Type CLK_APB1_BUS_CFG;             /* +0x200 */
  LPC_CCU_STAT_Type CLK_APB1_BUS_STAT;
  LPC_CCU1_CFG_160_Type CLK_APB1_MOTOCON_PWM_CFG;
  LPC_CCU_STAT_Type CLK_APB1_MOTOCON_PWM_STAT;
  LPC_CCU1_CFG_160_Type CLK_APB1_I2C0_CFG;
  LPC_CCU_STAT_Type CLK_APB1_I2C0_STAT;
  LPC_CCU1_CFG_160_Type CLK_APB1_I2S_CFG;
  LPC_CCU_STAT_Type CLK_APB1_I2S_STAT;
  LPC_CCU1_CFG_160_Type CLK_APB1_CAN1_CFG;
  LPC_CCU_STAT_Type CLK_APB1_CAN1_STAT;
       uint32_t RESERVED2[54];
  LPC_CCU1_CFG_160_Type CLK_SPIFI_CFG;                /* +0x300 */
  LPC_CCU_STAT_Type CLK_SPIFI_STAT;
       uint32_t RESERVED3[62];
  LPC_CCU1_CFG_160_Type CLK_M4_BUS_CFG;               /* +0x400 */
  LPC_CCU_STAT_Type CLK_M4_BUS_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_SPIFI_CFG;
  LPC_CCU_STAT_Type CLK_M4_SPIFI_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_GPIO_CFG;
  LPC_CCU_STAT_Type CLK_M4_GPIO_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_LCD_CFG;
  LPC_CCU_STAT_Type CLK_M4_LCD_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_ETHERNET_CFG;
  LPC_CCU_STAT_Type CLK_M4_ETHERNET_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_USB0_CFG;
  LPC_CCU_STAT_Type CLK_M4_USB0_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_EMC_CFG;
  LPC_CCU_STAT_Type CLK_M4_EMC_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_SDIO_CFG;
  LPC_CCU_STAT_Type CLK_M4_SDIO_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_DMA_CFG;
  LPC_CCU_STAT_Type CLK_M4_DMA_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_M4CORE_CFG;
  LPC_CCU_STAT_Type CLK_M4_M4CORE_STAT;
       uint32_t RESERVED4[6];
  LPC_CCU1_CFG_160_Type CLK_M4_SCT_CFG;               /* +0x468 */
  LPC_CCU_STAT_Type CLK_M4_SCT_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_USB1_CFG;
  LPC_CCU_STAT_Type CLK_M4_USB1_STAT;
  LPC_CCU1_CFG_161_Type CLK_M4_EMCDIV_CFG;
  LPC_CCU_STAT_Type CLK_M4_EMCDIV_STAT;
  LPC_CCU1_CFG_161_Type CLK_M4_FLASHA_CFG;
  LPC_CCU_STAT_Type CLK_M4_FLASHA_STAT;
  LPC_CCU1_CFG_161_Type CLK_M4_FLASHB_CFG;
  LPC_CCU_STAT_Type CLK_M4_FLASHB_STAT;
  LPC_CCU1_CFG_161_Type CLK_M4_M0APP_CFG;
  LPC_CCU_STAT_Type CLK_M4_M0APP_STAT;
  LPC_CCU1_CFG_161_Type CLK_M4_ADCHS_CFG;
  LPC_CCU_STAT_Type CLK_M4_ADCHS_STAT;
  LPC_CCU1_CFG_161_Type CLK_M4_EEPROM_CFG;
  LPC_CCU_STAT_Type CLK_M4_EEPROM_STAT;
       uint32_t RESERVED5[22];
  LPC_CCU1_CFG_160_Type CLK_M4_WWDT_CFG;              /* +0x500 */
  LPC_CCU_STAT_Type CLK_M4_WWDT_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_USART0_CFG;
  LPC_CCU_STAT_Type CLK_M4_USART0_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_UART1_CFG;
  LPC_CCU_STAT_Type CLK_M4_UART1_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_SSP0_CFG;
  LPC_CCU_STAT_Type CLK_M4_SSP0_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_TIMER0_CFG;
  LPC_CCU_STAT_Type CLK_M4_TIMER0_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_TIMER1_CFG;
  LPC_CCU_STAT_Type CLK_M4_TIMER1_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_SCU_CFG;
  LPC_CCU_STAT_Type CLK_M4_SCU_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_CREG_CFG;
  LPC_CCU_STAT_Type CLK_M4_CREG_STAT;
       uint32_t RESERVED6[48];
  LPC_CCU1_CFG_160_Type CLK_M4_RITIMER_CFG;           /* +0x600 */
  LPC_CCU_STAT_Type CLK_M4_RITIMER_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_USART2_CFG;
  LPC_CCU_STAT_Type CLK_M4_USART2_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_USART3_CFG;
  LPC_CCU_STAT_Type CLK_M4_USART3_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_TIMER2_CFG;
  LPC_CCU_STAT_Type CLK_M4_TIMER2_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_TIMER3_CFG;
  LPC_CCU_STAT_Type CLK_M4_TIMER3_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_SSP1_CFG;
  LPC_CCU_STAT_Type CLK_M4_SSP1_STAT;
  LPC_CCU1_CFG_160_Type CLK_M4_QEI_CFG;
  LPC_CCU_STAT_Type CLK_M4_QEI_STAT;
       uint32_t RESERVED7[50];
  LPC_CCU1_CFG_160_Type CLK_PERIPH_BUS_CFG;           /* +0x700 */
  LPC_CCU_STAT_Type CLK_PERIPH_BUS_STAT;
       uint32_t RESERVED8[2];
  LPC_CCU1_CFG_160_Type CLK_PERIPH_CORE_CFG;          /* +0x710 */
  LPC_CCU_STAT_Type CLK_PERIPH_CORE_STAT;
  LPC_CCU1_CFG_160_Type CLK_PERIPH_SGPIO_CFG;
  LPC_CCU_STAT_Type CLK_PERIPH_SGPIO_STAT;
       uint32_t RESERVED9[56];
  LPC_CCU1_CFG_160_Type CLK_USB0_CFG;                 /* +0x800 */
  LPC_CCU_STAT_Type CLK_USB0_STAT;
       uint32_t RESERVED10[62];
  LPC_CCU1_CFG_160_Type CLK_USB1_CFG;                 /* +0x900 */
  LPC_CCU_STAT_Type CLK_USB1_STAT;
       uint32_t RESERVED11[62];
  LPC_CCU1_CFG_160_Type CLK_SPI_CFG;                  /* +0xa00 */
  LPC_CCU_STAT_Type CLK_SPI_STAT;
       uint32_t RESERVED12[62];
  LPC_CCU1_CFG_160_Type CLK_ADCHS_CFG;                /* +0xb00 */
  LPC_CCU_STAT_Type CLK_ADCHS_STAT;
} LPC_CCU1_Type;

typedef LPC_CCU1_CFG_160_Type LPC_CCU2_CFG_164_Type ;

typedef struct {
  __IO uint32_t PM;
  __I  uint32_t BASE_STAT;
  __I  uint32_t RESERVED_x008[62];
  LPC_CCU2_CFG_164_Type CLK_AUDIO_CFG;
  LPC_CCU_STAT_Type CLK_AUDIO_STAT;
  __I  uint32_t RESERVED_x108[62];
  LPC_CCU2_CFG_164_Type CLK_APB2_USART3_CFG;
  LPC_CCU_STAT_Type CLK_APB2_USART3_STAT;
  __I  uint32_t RESERVED_x208[62];
  LPC_CCU2_CFG_164_Type CLK_APB2_USART2_CFG;
  LPC_CCU_STAT_Type CLK_APB2_USART2_STAT;
  __I  uint32_t RESERVED_x308[62];
  LPC_CCU2_CFG_164_Type CLK_APB0_UART1_CFG;
  LPC_CCU_STAT_Type CLK_APB0_UART1_STAT;
  __I  uint32_t RESERVED_x408[62];
  LPC_CCU2_CFG_164_Type CLK_APB0_USART0_CFG;
  LPC_CCU_STAT_Type CLK_APB0_USART0_STAT;
  __I  uint32_t RESERVED_x508[62];
  LPC_CCU2_CFG_164_Type CLK_APB2_SSP1_CFG;
  LPC_CCU_STAT_Type CLK_APB2_SSP1_STAT;
  __I  uint32_t RESERVED_x608[62];
  LPC_CCU2_CFG_164_Type CLK_APB0_SSP0_CFG;
  LPC_CCU_STAT_Type CLK_APB0_SSP0_STAT;
  __I  uint32_t RESERVED_x708[62];
  LPC_CCU2_CFG_164_Type CLK_SDIO_CFG;
  LPC_CCU_STAT_Type CLK_SDIO_STAT;
} LPC_CCU2_Type;

// ------------------------------------------------------------------------------------------------
// -----                                          RGU                                         -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10503 Chapter title=LPC43xx Reset Generation Unit (RGU) Modification date=1/28/2014 Major revision=1 Minor revision=8
  */

