portapack-mayhem/mayhem-firmware/firmware/chibios-portapack/os/hal/platforms/LPC43xx/lpc43xx.inc
typedef struct {
       uint32_t RESERVED0[64];          /* 0x000 */
  __O  uint32_t RESET_CTRL[2];          /* 0x100 */
       uint32_t RESERVED1[2];
  __IO uint32_t RESET_STATUS[4];        /* 0x110 */
       uint32_t RESERVED2[12];
  __I  uint32_t RESET_ACTIVE_STATUS[2]; /* 0x150 */
       uint32_t RESERVED3[170];
  __IO uint32_t RESET_EXT_STAT[64];     /* 0x400 */
} LPC_RGU_Type;

// ------------------------------------------------------------------------------------------------
// -----                                          SCU                                         -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10503 Chapter title=LPC43xx System Control Unit (SCU)/IO configuration Modification date=1/28/2014 Major revision=1 Minor revision=8
  */

typedef struct {
  union {
    struct {
      /* 0x000 */
      union {
        struct {
          __IO uint32_t SFSP0_0;
          __IO uint32_t SFSP0_1;
        };
        __IO uint32_t SFSP0[2];
      };
      uint32_t RESERVED0[30];

      /* 0x080 */
      union {
        struct {
          __IO uint32_t SFSP1_0;
          __IO uint32_t SFSP1_1;
          __IO uint32_t SFSP1_2;
          __IO uint32_t SFSP1_3;
          __IO uint32_t SFSP1_4;
          __IO uint32_t SFSP1_5;
          __IO uint32_t SFSP1_6;
          __IO uint32_t SFSP1_7;
          __IO uint32_t SFSP1_8;
          __IO uint32_t SFSP1_9;
          __IO uint32_t SFSP1_10;
          __IO uint32_t SFSP1_11;
          __IO uint32_t SFSP1_12;
          __IO uint32_t SFSP1_13;
          __IO uint32_t SFSP1_14;
          __IO uint32_t SFSP1_15;
          __IO uint32_t SFSP1_16;
          __IO uint32_t SFSP1_17;
          __IO uint32_t SFSP1_18;
          __IO uint32_t SFSP1_19;
          __IO uint32_t SFSP1_20;
        };
        __IO uint32_t SFSP1[21];
      };
      uint32_t RESERVED1[11];

      /* 0x100 */
      union {
        struct {
          __IO uint32_t SFSP2_0;
          __IO uint32_t SFSP2_1;
          __IO uint32_t SFSP2_2;
          __IO uint32_t SFSP2_3;
          __IO uint32_t SFSP2_4;
          __IO uint32_t SFSP2_5;
          __IO uint32_t SFSP2_6;
          __IO uint32_t SFSP2_7;
          __IO uint32_t SFSP2_8;
          __IO uint32_t SFSP2_9;
          __IO uint32_t SFSP2_10;
          __IO uint32_t SFSP2_11;
          __IO uint32_t SFSP2_12;
          __IO uint32_t SFSP2_13;
        };
        __IO uint32_t SFSP2[14];
      };
      uint32_t RESERVED2[18];

      /* 0x180 */
      union {
        struct {
          __IO uint32_t SFSP3_0;
          __IO uint32_t SFSP3_1;
          __IO uint32_t SFSP3_2;
          __IO uint32_t SFSP3_3;
          __IO uint32_t SFSP3_4;
          __IO uint32_t SFSP3_5;
          __IO uint32_t SFSP3_6;
          __IO uint32_t SFSP3_7;
          __IO uint32_t SFSP3_8;
        };
        __IO uint32_t SFSP3[9];
      };
      uint32_t RESERVED3[23];

      /* 0x200 */
      union {
        struct {
          __IO uint32_t SFSP4_0;
          __IO uint32_t SFSP4_1;
          __IO uint32_t SFSP4_2;
          __IO uint32_t SFSP4_3;
          __IO uint32_t SFSP4_4;
          __IO uint32_t SFSP4_5;
          __IO uint32_t SFSP4_6;
          __IO uint32_t SFSP4_7;
          __IO uint32_t SFSP4_8;
          __IO uint32_t SFSP4_9;
          __IO uint32_t SFSP4_10;
        };
        __IO uint32_t SFSP4[11];
      };
      uint32_t RESERVED4[21];

      /* 0x280 */
      union {
        struct {
          __IO uint32_t SFSP5_0;
          __IO uint32_t SFSP5_1;
          __IO uint32_t SFSP5_2;
          __IO uint32_t SFSP5_3;
          __IO uint32_t SFSP5_4;
          __IO uint32_t SFSP5_5;
          __IO uint32_t SFSP5_6;
          __IO uint32_t SFSP5_7;
        };
        __IO uint32_t SFSP5[8];
      };
      uint32_t RESERVED5[24];

      /* 0x300 */
      union {
        struct {
          __IO uint32_t SFSP6_0;
          __IO uint32_t SFSP6_1;
          __IO uint32_t SFSP6_2;
          __IO uint32_t SFSP6_3;
          __IO uint32_t SFSP6_4;
          __IO uint32_t SFSP6_5;
          __IO uint32_t SFSP6_6;
          __IO uint32_t SFSP6_7;
          __IO uint32_t SFSP6_8;
          __IO uint32_t SFSP6_9;
          __IO uint32_t SFSP6_10;
          __IO uint32_t SFSP6_11;
          __IO uint32_t SFSP6_12;
        };
        __IO uint32_t SFSP6[13];
      };
      uint32_t RESERVED6[19];

      /* 0x380 */
      union {
        struct {
          __IO uint32_t SFSP7_0;
          __IO uint32_t SFSP7_1;
          __IO uint32_t SFSP7_2;
          __IO uint32_t SFSP7_3;
          __IO uint32_t SFSP7_4;
          __IO uint32_t SFSP7_5;
          __IO uint32_t SFSP7_6;
          __IO uint32_t SFSP7_7;
        };
        __IO uint32_t SFSP7[8];
      };
      uint32_t RESERVED7[24];

      /* 0x400 */
      union {
        struct {
          __IO uint32_t SFSP8_0;
          __IO uint32_t SFSP8_1;
          __IO uint32_t SFSP8_2;
          __IO uint32_t SFSP8_3;
          __IO uint32_t SFSP8_4;
          __IO uint32_t SFSP8_5;
          __IO uint32_t SFSP8_6;
          __IO uint32_t SFSP8_7;
          __IO uint32_t SFSP8_8;
        };
        __IO uint32_t SFSP8[9];
      };
      uint32_t RESERVED8[23];

      /* 0x480 */
      union {
        struct {
          __IO uint32_t SFSP9_0;
          __IO uint32_t SFSP9_1;
          __IO uint32_t SFSP9_2;
          __IO uint32_t SFSP9_3;
          __IO uint32_t SFSP9_4;
          __IO uint32_t SFSP9_5;
          __IO uint32_t SFSP9_6;
        };
        __IO uint32_t SFSP9[7];
      };
      uint32_t RESERVED9[25];

      /* 0x500 */
      union {
        struct {
          __IO uint32_t SFSPA_0;
          __IO uint32_t SFSPA_1;
          __IO uint32_t SFSPA_2;
          __IO uint32_t SFSPA_3;
          __IO uint32_t SFSPA_4;
        };
        __IO uint32_t SFSPA[5];
      };
      uint32_t RESERVEDA[27];

      /* 0x580 */
      union {
        struct {
          __IO uint32_t SFSPB_0;
          __IO uint32_t SFSPB_1;
          __IO uint32_t SFSPB_2;
          __IO uint32_t SFSPB_3;
          __IO uint32_t SFSPB_4;
          __IO uint32_t SFSPB_5;
          __IO uint32_t SFSPB_6;
        };
        __IO uint32_t SFSPB[7];
      };
      uint32_t RESERVEDB[25];

