portapack-mayhem/mayhem-firmware/firmware/chibios-portapack/os/hal/platforms/LPC43xx/lpc43xx.inc
      /* 0x600 */
      union {
        struct {
          __IO uint32_t SFSPC_0;
          __IO uint32_t SFSPC_1;
          __IO uint32_t SFSPC_2;
          __IO uint32_t SFSPC_3;
          __IO uint32_t SFSPC_4;
          __IO uint32_t SFSPC_5;
          __IO uint32_t SFSPC_6;
          __IO uint32_t SFSPC_7;
          __IO uint32_t SFSPC_8;
          __IO uint32_t SFSPC_9;
          __IO uint32_t SFSPC_10;
          __IO uint32_t SFSPC_11;
          __IO uint32_t SFSPC_12;
          __IO uint32_t SFSPC_13;
          __IO uint32_t SFSPC_14;
        };
        __IO uint32_t SFSPC[15];
      };
      uint32_t RESERVEDC[17];

      /* 0x680 */
      union {
        struct {
          __IO uint32_t SFSPD_0;
          __IO uint32_t SFSPD_1;
          __IO uint32_t SFSPD_2;
          __IO uint32_t SFSPD_3;
          __IO uint32_t SFSPD_4;
          __IO uint32_t SFSPD_5;
          __IO uint32_t SFSPD_6;
          __IO uint32_t SFSPD_7;
          __IO uint32_t SFSPD_8;
          __IO uint32_t SFSPD_9;
          __IO uint32_t SFSPD_10;
          __IO uint32_t SFSPD_11;
          __IO uint32_t SFSPD_12;
          __IO uint32_t SFSPD_13;
          __IO uint32_t SFSPD_14;
          __IO uint32_t SFSPD_15;
          __IO uint32_t SFSPD_16;
        };
        __IO uint32_t SFSPD[17];
      };
      uint32_t RESERVEDD[15];

      /* 0x700 */
      union {
        struct {
          __IO uint32_t SFSPE_0;
          __IO uint32_t SFSPE_1;
          __IO uint32_t SFSPE_2;
          __IO uint32_t SFSPE_3;
          __IO uint32_t SFSPE_4;
          __IO uint32_t SFSPE_5;
          __IO uint32_t SFSPE_6;
          __IO uint32_t SFSPE_7;
          __IO uint32_t SFSPE_8;
          __IO uint32_t SFSPE_9;
          __IO uint32_t SFSPE_10;
          __IO uint32_t SFSPE_11;
          __IO uint32_t SFSPE_12;
          __IO uint32_t SFSPE_13;
          __IO uint32_t SFSPE_14;
          __IO uint32_t SFSPE_15;
        };
        __IO uint32_t SFSPE[16];
      };
      uint32_t RESERVEDE[16];

      /* 0x780 */
      union {
        struct {
          __IO uint32_t SFSPF_0;
          __IO uint32_t SFSPF_1;
          __IO uint32_t SFSPF_2;
          __IO uint32_t SFSPF_3;
          __IO uint32_t SFSPF_4;
          __IO uint32_t SFSPF_5;
          __IO uint32_t SFSPF_6;
          __IO uint32_t SFSPF_7;
          __IO uint32_t SFSPF_8;
          __IO uint32_t SFSPF_9;
          __IO uint32_t SFSPF_10;
          __IO uint32_t SFSPF_11;
        };
        __IO uint32_t SFSPF[12];
      };
      uint32_t RESERVEDF[20];
    };
    __IO uint32_t SFSP[16][32];
    __IO uint32_t SFS[512];
  };

  /* 0x800 */
  uint32_t RESERVEDG[256];

  /* 0xc00 */
  union {
    struct {
      __IO uint32_t SFSCLK0;
      __IO uint32_t SFSCLK1;
      __IO uint32_t SFSCLK2;
      __IO uint32_t SFSCLK3;
    };
    __IO uint32_t SFSCLK[4];
  };
  uint32_t RESERVEDH[28];

  /* 0xc80 */
  __IO uint32_t SFSUSB;
  __IO uint32_t SFSI2C0;
  union {
    struct {
      __IO uint32_t ENAIO0;
      __IO uint32_t ENAIO1;
      __IO uint32_t ENAIO2;
    };
    __IO uint32_t ENAIO[3];
  };
  uint32_t RESERVEDI[27];

  /* 0xd00 */
  __IO uint32_t EMCDELAYCLK;
  uint32_t RESERVEDJ[31];

  /* 0xd80 */
  __IO uint32_t SDDELAY;
  uint32_t RESERVEDK[31];

  /* 0xe00 */
  union {
    struct {
      __IO uint32_t PINTSEL0;
      __IO uint32_t PINTSEL1;
    };
    __IO uint32_t PINTSEL[2];
  };
} LPC_SCU_Type;

// ------------------------------------------------------------------------------------------------
// -----                                       GPIO_PORT                                      -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10503 Chapter title=LPC43xx GPIO Modification date=1/28/2014 Major revision=1 Minor revision=8
  */

typedef struct {
  union {
    struct {
      __IO uint8_t B0[32];                      /*!< (@ +0x0000) Byte pin registers port 0; pins PIO0_0 to PIO0_31 */
      __IO uint8_t B1[32];                      /*!< (@ +0x0020) Byte pin registers port 1 */
      __IO uint8_t B2[32];                      /*!< (@ +0x0040) Byte pin registers port 2 */
      __IO uint8_t B3[32];                      /*!< (@ +0x0060) Byte pin registers port 3 */
      __IO uint8_t B4[32];                      /*!< (@ +0x0080) Byte pin registers port 4 */
      __IO uint8_t B5[32];                      /*!< (@ +0x00a0) Byte pin registers port 5 */
      __IO uint8_t B6[32];                      /*!< (@ +0x00c0) Byte pin registers port 6 */
      __IO uint8_t B7[32];                      /*!< (@ +0x00e0) Byte pin registers port 7 */
    };
    __IO uint8_t B[256];                        /*!< (@ +0x0000) Byte pin registers port 0-7 */
  };
  __I  uint32_t RESERVED0[960];                 /*!< (@ +0x0100) */
  union {
    struct {
      __IO uint32_t W0[32];                     /*!< (@ +0x1000) Word pin registers port 0 */
      __IO uint32_t W1[32];                     /*!< (@ +0x1080) Word pin registers port 1 */
      __IO uint32_t W2[32];                     /*!< (@ +0x1100) Word pin registers port 2 */
      __IO uint32_t W3[32];                     /*!< (@ +0x1180) Word pin registers port 3 */
      __IO uint32_t W4[32];                     /*!< (@ +0x1200) Word pin registers port 4 */
      __IO uint32_t W5[32];                     /*!< (@ +0x1280) Word pin registers port 5 */
      __IO uint32_t W6[32];                     /*!< (@ +0x1300) Word pin registers port 6 */
      __IO uint32_t W7[32];                     /*!< (@ +0x1380) Word pin registers port 7 */
    };
    __IO uint32_t W[256];                       /*!< (@ +0x1000) Word pin registers port 0-7 */
  };
       uint32_t RESERVED1[768];
  __IO uint32_t DIR[8];     /* 0x2000 */
       uint32_t RESERVED2[24];
  __IO uint32_t MASK[8];    /* 0x2080 */
       uint32_t RESERVED3[24];
  __IO uint32_t PIN[8];     /* 0x2100 */
       uint32_t RESERVED4[24];
  __IO uint32_t MPIN[8];    /* 0x2180 */
       uint32_t RESERVED5[24];
  __IO uint32_t SET[8];     /* 0x2200 */
       uint32_t RESERVED6[24];
  __O  uint32_t CLR[8];     /* 0x2280 */
       uint32_t RESERVED7[24];
  __O  uint32_t NOT[8];     /* 0x2300 */
} LPC_GPIO_Type;

// ------------------------------------------------------------------------------------------------
// -----                                       GPIO_INT                                       -----
// ------------------------------------------------------------------------------------------------

