portapack-mayhem/mayhem-firmware/firmware/chibios-portapack/os/hal/platforms/LPC43xx/lpc43xx.inc
typedef struct {
  __IO uint32_t ISEL;
  __IO uint32_t IENR;
  __I  uint32_t SIENR;
  __I  uint32_t CIENR;
  __IO uint32_t IENF;
  __I  uint32_t SIENF;
  __I  uint32_t CIENF;
  __IO uint32_t RISE;
  __IO uint32_t FALL;
  __IO uint32_t IST;
} LPC_GPIO_INT_Type;

// ------------------------------------------------------------------------------------------------
// -----                                         SGPIO                                        -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10503 Chapter title=LPC43xx Serial GPIO (SGPIO) date=1/28/2014 Major revision=1 Minor revision=8
  */

typedef struct {
  __IO uint32_t OUT_MUX_CFG[16];
  __IO uint32_t SGPIO_MUX_CFG[16];
  __IO uint32_t SLICE_MUX_CFG[16];
  __IO uint32_t REG[16];
  __IO uint32_t REG_SS[16];
  __IO uint32_t PRESET[16];
  __IO uint32_t COUNT[16];
  __IO uint32_t POS[16];
  __IO uint32_t MASK_A;
  __IO uint32_t MASK_H;
  __IO uint32_t MASK_I;
  __IO uint32_t MASK_P;
  __I  uint32_t GPIO_INREG;
  __IO uint32_t GPIO_OUTREG;
  __IO uint32_t GPIO_OENREG;
  __IO uint32_t CTRL_ENABLE;
  __IO uint32_t CTRL_DISABLE;
       uint32_t RESERVED0[823];
  __O  uint32_t CLR_EN_0;
  __O  uint32_t SET_EN_0;
  __I  uint32_t ENABLE_0;
  __I  uint32_t STATUS_0;
  __O  uint32_t CLR_STATUS_0;
  __O  uint32_t SET_STATUS_0;
       uint32_t RESERVED1[2];
  __O  uint32_t CLR_EN_1;
  __O  uint32_t SET_EN_1;
  __I  uint32_t ENABLE_1;
  __I  uint32_t STATUS_1;
  __O  uint32_t CLR_STATUS_1;
  __O  uint32_t SET_STATUS_1;
       uint32_t RESERVED2[2];
  __O  uint32_t CLR_EN_2;
  __O  uint32_t SET_EN_2;
  __I  uint32_t ENABLE_2;
  __I  uint32_t STATUS_2;
  __O  uint32_t CLR_STATUS_2;
  __O  uint32_t SET_STATUS_2;
       uint32_t RESERVED3[2];
  __O  uint32_t CLR_EN_3;
  __O  uint32_t SET_EN_3;
  __I  uint32_t ENABLE_3;
  __I  uint32_t STATUS_3;
  __O  uint32_t CLR_STATUS_3;
  __O  uint32_t SET_STATUS_3;
} LPC_SGPIO_Type;

// ------------------------------------------------------------------------------------------------
// -----                                         GPDMA                                        -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10503 Chapter title=LPC43xx General Purpose DMA (GPDMA) date=1/28/2014 Major revision=1 Minor revision=8
  */

struct LPC_GPDMA_LLI_Type;
typedef struct LPC_GPDMA_LLI_Type LPC_GPDMA_LLI_Type;

struct LPC_GPDMA_LLI_Type {
  uint32_t CSRCADDR;
  uint32_t CDESTADDR;
  uint32_t CLLI;
  uint32_t CCONTROL;
};

typedef struct {
  __IO uint32_t SRCADDR;      /* +0x00 */
  __IO uint32_t DESTADDR;
  __IO uint32_t LLI;
  __IO uint32_t CONTROL;
  __IO uint32_t CONFIG;       /* +0x10 */
       uint32_t RESERVED0[3];
} LPC_GPDMA_Channel_Type;

typedef struct {
  __I  uint32_t INTSTAT;        /* +0x000 */
  __I  uint32_t INTTCSTAT;
  __O  uint32_t INTTCCLR;
  __I  uint32_t INTERRSTAT;
  __O  uint32_t INTERRCLR;      /* +0x010 */
  __I  uint32_t RAWINTTCSTAT;
  __I  uint32_t RAWINTERRSTAT;
  __I  uint32_t ENBLDCHNS;
  __IO uint32_t SOFTBREQ;       /* +0x020 */
  __IO uint32_t SOFTSREQ;
  __IO uint32_t SOFTLBREQ;
  __IO uint32_t SOFTLSREQ;
  __IO uint32_t CONFIG;         /* +0x030 */
  __IO uint32_t SYNC;
       uint32_t RESERVED0[50];
  LPC_GPDMA_Channel_Type CH[8]; /* +0x100 */
} LPC_GPDMA_Type;

// ------------------------------------------------------------------------------------------------
// -----                                         SDMMC                                        -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10503 Chapter title=LPC43xx SD/MMC Interface Modification date=1/28/2014 Major revision=1 Minor revision=8
  */

typedef struct {
  uint32_t DESC0;
  uint32_t DESC1;
  uint32_t DESC2;
  uint32_t DESC3;
} LPC_SDMMC_DESC_Type;

typedef struct {
  __IO uint32_t CTRL;
  __IO uint32_t PWREN;
  __IO uint32_t CLKDIV;
  __IO uint32_t CLKSRC;
  __IO uint32_t CLKENA;
  __IO uint32_t TMOUT;
  __IO uint32_t CTYPE;
  __IO uint32_t BLKSIZ;
  __IO uint32_t BYTCNT;
  __IO uint32_t INTMASK;
  __IO uint32_t CMDARG;
  __IO uint32_t CMD;
  __I  uint32_t RESP0;
  __I  uint32_t RESP1;
  __I  uint32_t RESP2;
  __I  uint32_t RESP3;
  __I  uint32_t MINTSTS;
  __IO uint32_t RINTSTS;
  __I  uint32_t STATUS;
  __IO uint32_t FIFOTH;
  __I  uint32_t CDETECT;
  __I  uint32_t WRTPRT;
       uint32_t RESERVED0;
  __I  uint32_t TCBCNT;
  __I  uint32_t TBBCNT;
  __IO uint32_t DEBNCE;
       uint32_t RESERVED1[4];
  __IO uint32_t RST_N;
       uint32_t RESERVED2;
  __IO uint32_t BMOD;
  __O  uint32_t PLDMND;
  __IO uint32_t DBADDR;
  __IO uint32_t IDSTS;
  __IO uint32_t IDINTEN;
  __I  uint32_t DSCADDR;
  __I  uint32_t BUFADDR;
       uint32_t RESERVED3[25];
  __IO uint32_t DATA;
} LPC_SDMMC_Type;

// ------------------------------------------------------------------------------------------------
// -----                                         TIMER                                        -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10503 Chapter title=LPC43xx SPI Flash Interface (SPIFI) Modification date=1/28/2014 Major revision=1 Minor revision=8
  */

typedef struct {
  __IO uint32_t CTRL;
  __IO uint32_t CMD;
  __IO uint32_t ADDR;
  __IO uint32_t IDATA;
  __IO uint32_t CLIMIT;
  __IO uint32_t DATA;
  __IO uint32_t MCMD;
  __IO uint32_t STAT;
} LPC_SPIFI_Type;

// ------------------------------------------------------------------------------------------------
// -----                                         TIMER                                        -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10503 Chapter title=LPC43xx Timer0/1/2/3 Modification date=1/28/2014 Major revision=1 Minor revision=8
  */

