portapack-mayhem/mayhem-firmware/firmware/chibios-portapack/os/hal/platforms/LPC43xx/lpc43xx.inc
#define I2C_CONSET_AA       (1 << 2)
#define I2C_CONSET_SI       (1 << 3)
#define I2C_CONSET_STO      (1 << 4)
#define I2C_CONSET_STA      (1 << 5)
#define I2C_CONSET_I2EN     (1 << 6)

#define I2C_CONCLR_AAC      (1 << 2)
#define I2C_CONCLR_SIC      (1 << 3)
#define I2C_CONCLR_STAC     (1 << 5)
#define I2C_CONCLR_I2ENC    (1 << 6)

// ------------------------------------------------------------------------------------------------
// -----                                          ADC                                         -----
// ------------------------------------------------------------------------------------------------

typedef struct {
  __IO uint32_t CR;
  __I  uint32_t GDR;
       uint32_t RESERVED0;
  __IO uint32_t INTEN;
  __I  uint32_t DR[8];
  __I  uint32_t STAT;
} LPC_ADCx_Type;

#if defined ( __CC_ARM   )
  #pragma no_anon_unions
#endif

// ------------------------------------------------------------------------------------------------
// -----                                 Peripheral memory map                                -----
// ------------------------------------------------------------------------------------------------

#define LPC_AHB_BASE              (0x40000000)
#define LPC_SCT_BASE              (LPC_AHB_BASE + 0x00000)
#define LPC_GPDMA_BASE            (LPC_AHB_BASE + 0x02000)
#define LPC_SPIFI_BASE            (LPC_AHB_BASE + 0x03000)
#define LPC_SDMMC_BASE            (LPC_AHB_BASE + 0x04000)
#define LPC_EMC_BASE              (LPC_AHB_BASE + 0x05000)
#define LPC_USB0_BASE             (LPC_AHB_BASE + 0x06000)
#define LPC_USB1_BASE             (LPC_AHB_BASE + 0x07000)
#define LPC_LCD_BASE              (LPC_AHB_BASE + 0x08000)
#define LPC_ETHERNET_BASE         (LPC_AHB_BASE + 0x10000)

#define LPC_RTC_DOMAIN_BASE       (0x40040000)
#define LPC_ALARM_TIMER_BASE      (LPC_RTC_DOMAIN_BASE + 0x0000)
#define LPC_BACKUP_REG_BASE       (LPC_RTC_DOMAIN_BASE + 0x1000)
#define LPC_POWER_MODE_CTRL_BASE  (LPC_RTC_DOMAIN_BASE + 0x2000)
#define LPC_CREG_BASE             (LPC_RTC_DOMAIN_BASE + 0x3000)
#define LPC_EVENT_ROUTER_BASE     (LPC_RTC_DOMAIN_BASE + 0x4000)
#define LPC_OTP_CTRL_BASE         (LPC_RTC_DOMAIN_BASE + 0x5000)
#define LPC_RTC_BASE              (LPC_RTC_DOMAIN_BASE + 0x6000)

#define LPC_CLOCK_RESET_CTRL_BASE (0x40050000)
#define LPC_CGU_BASE              (LPC_CLOCK_RESET_CTRL_BASE + 0x0000)
#define LPC_CCU1_BASE             (LPC_CLOCK_RESET_CTRL_BASE + 0x1000)
#define LPC_CCU2_BASE             (LPC_CLOCK_RESET_CTRL_BASE + 0x2000)
#define LPC_RGU_BASE              (LPC_CLOCK_RESET_CTRL_BASE + 0x3000)

#define LPC_APB0_BASE             (0x40080000)
#define LPC_WWDT_BASE             (LPC_APB0_BASE + 0x0000)
#define LPC_USART0_BASE           (LPC_APB0_BASE + 0x1000)
#define LPC_UART1_BASE            (LPC_APB0_BASE + 0x2000)
#define LPC_SSP0_BASE             (LPC_APB0_BASE + 0x3000)
#define LPC_TIMER0_BASE           (LPC_APB0_BASE + 0x4000)
#define LPC_TIMER1_BASE           (LPC_APB0_BASE + 0x5000)
#define LPC_SCU_BASE              (LPC_APB0_BASE + 0x6000)
#define LPC_GPIO_INT_BASE         (LPC_APB0_BASE + 0x7000)
#define LPC_GPIO_GROUP0_INT_BASE  (LPC_APB0_BASE + 0x8000)
#define LPC_GPIO_GROUP1_INT_BASE  (LPC_APB0_BASE + 0x9000)

#define LPC_APB1_BASE             (0x400a0000)
#define LPC_MCPWM_BASE            (LPC_APB1_BASE + 0x0000)
#define LPC_I2C0_BASE             (LPC_APB1_BASE + 0x1000)
#define LPC_I2S0_BASE             (LPC_APB1_BASE + 0x2000)
#define LPC_I2S1_BASE             (LPC_APB1_BASE + 0x3000)
#define LPC_C_CAN1_BASE           (LPC_APB1_BASE + 0x4000)

#define LPC_APB2_BASE             (0x400c0000)
#define LPC_RITIMER_BASE          (LPC_APB2_BASE + 0x0000)
#define LPC_USART2_BASE           (LPC_APB2_BASE + 0x1000)
#define LPC_USART3_BASE           (LPC_APB2_BASE + 0x2000)
#define LPC_TIMER2_BASE           (LPC_APB2_BASE + 0x3000)
#define LPC_TIMER3_BASE           (LPC_APB2_BASE + 0x4000)
#define LPC_SSP1_BASE             (LPC_APB2_BASE + 0x5000)
#define LPC_QEI_BASE              (LPC_APB2_BASE + 0x6000)
#define LPC_GIMA_BASE             (LPC_APB2_BASE + 0x7000)

#define LPC_APB3_BASE             (0x400e0000)
#define LPC_I2C1_BASE             (LPC_APB3_BASE + 0x0000)
#define LPC_DAC_BASE              (LPC_APB3_BASE + 0x1000)
#define LPC_C_CAN0_BASE           (LPC_APB3_BASE + 0x2000)
#define LPC_ADC0_BASE             (LPC_APB3_BASE + 0x3000)
#define LPC_ADC1_BASE             (LPC_APB3_BASE + 0x4000)

#define LPC_ADCHS_BASE            (0x400f0000)
#define LPC_GPIO_BASE             (0x400f4000)
#define LPC_SPI_BASE              (0x40100000)
#define LPC_SGPIO_BASE            (0x40101000)

#define LPC_BITBAND_BASE          (0x42000000)

#define LPC_SPIFI_DATA_CACHED_BASE  (0x14000000)
#define LPC_SPIFI_DATA_BASE       (0x80000000)

// ------------------------------------------------------------------------------------------------
// -----                                Peripheral declaration                                -----
// ------------------------------------------------------------------------------------------------


#define LPC_GPDMA                 ((LPC_GPDMA_Type          *) LPC_GPDMA_BASE)
#define LPC_SPIFI                 ((LPC_SPIFI_Type          *) LPC_SPIFI_BASE)
#define LPC_SDMMC                 ((LPC_SDMMC_Type          *) LPC_SDMMC_BASE)
#define LPC_CREG                  ((LPC_CREG_Type           *) LPC_CREG_BASE)
#define LPC_RTC                   ((LPC_RTC_Type            *) LPC_RTC_BASE)
#define LPC_CGU                   ((LPC_CGU_Type            *) LPC_CGU_BASE)
#define LPC_CCU1                  ((LPC_CCU1_Type           *) LPC_CCU1_BASE)
#define LPC_CCU2                  ((LPC_CCU2_Type           *) LPC_CCU2_BASE)
#define LPC_RGU                   ((LPC_RGU_Type            *) LPC_RGU_BASE)
#define LPC_USART0                ((LPC_USART_Type          *) LPC_USART0_BASE)
#define LPC_UART1                 ((LPC_UART_Type           *) LPC_UART1_BASE)
#define LPC_SSP0                  ((LPC_SSPx_Type           *) LPC_SSP0_BASE)
#define LPC_TIMER0                ((LPC_TIMER_Type          *) LPC_TIMER0_BASE)
#define LPC_TIMER1                ((LPC_TIMER_Type          *) LPC_TIMER1_BASE)
#define LPC_SCU                   ((LPC_SCU_Type            *) LPC_SCU_BASE)
#define LPC_GPIO_INT              ((LPC_GPIO_INT_Type       *) LPC_GPIO_INT_BASE)
#define LPC_I2C0                  ((LPC_I2Cx_Type           *) LPC_I2C0_BASE)
#define LPC_I2S0                  ((LPC_I2S_Type            *) LPC_I2S0_BASE)
#define LPC_I2S1                  ((LPC_I2S_Type            *) LPC_I2S1_BASE)
#define LPC_RITIMER               ((LPC_RITIMER_Type        *) LPC_RITIMER_BASE)
#define LPC_USART2                ((LPC_USART_Type          *) LPC_USART2_BASE)
#define LPC_USART3                ((LPC_USART_Type          *) LPC_USART3_BASE)
#define LPC_TIMER2                ((LPC_TIMER_Type          *) LPC_TIMER2_BASE)
#define LPC_TIMER3                ((LPC_TIMER_Type          *) LPC_TIMER3_BASE)
#define LPC_MCPWM                 ((LPC_MCPWM_Type          *) LPC_MCPWM_BASE)
#define LPC_SSP1                  ((LPC_SSPx_Type           *) LPC_SSP1_BASE)
#define LPC_I2C1                  ((LPC_I2Cx_Type           *) LPC_I2C1_BASE)
#define LPC_ADC0                  ((LPC_ADCx_Type           *) LPC_ADC0_BASE)
#define LPC_ADC1                  ((LPC_ADCx_Type           *) LPC_ADC1_BASE)
#define LPC_GPIO                  ((LPC_GPIO_Type           *) LPC_GPIO_BASE)
#define LPC_SGPIO                 ((LPC_SGPIO_Type          *) LPC_SGPIO_BASE)
#define LPC_EVENTROUTER           ((LPC_EVENTROUTER_Type *) LPC_EVENT_ROUTER_BASE)

#ifdef __cplusplus
}
#endif

/** @} */ /* End of group LPC43xx */
/** @} */ /* End of group NXP */

#endif  // __LPC43XX_H__
